# SteelElementTaskNotFinished Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SteelElementFailures..::..SteelElementTaskNotFinished Property
BuiltInFailures..::..SteelElementFailures Class See Also
---
Advance Steel tasks not finished.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SteelElementTaskNotFinished { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElementTaskNotFinished As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SteelElementTaskNotFinished {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SteelElementFailures Class
Autodesk.Revit.DB Namespace